pmp-pharm/cara-test.http

### Configuration of Cara systems
https://pmp.hug.ch/pmp/mhd/debug

### Log
https://pmp.hug.ch/pmp/mhd/logs


### PHARM-1 Query from Quentin specifying ondemand
POST https://pmp.hug.ch/pmp/services/cmpd/pharm1 HTTP/1.1
Content-Type: application/soap+xml

< ./pharm1_fml_query.xml

### PHARM-1 Query no doc entry (returns error)
POST https://pmp.hug.ch/pmp/services/cmpd/pharm1 HTTP/1.1
Content-Type: application/soap+xml

< ./pharm1_fml_query_ondemand.xml

### PHARM-1 Query all (on demand and stable)
POST https://pmp.hug.ch/pmp/services/cmpd/pharm1 HTTP/1.1
Content-Type: application/soap+xml

< ./pharm1_fml_query_all.xml


### PHARM-1 Query all with no security
POST https://pmp.hug.ch/pmp/services/cmpd/pharm1 HTTP/1.1
Content-Type: application/soap+xml

< ./pharm1_fml_query_all_nosecurity.xml


### XDS-43 Document Retrieve APPC - WORKS
POST https://pmp.hug.ch/pmp/services/xds/iti43 HTTP/1.1
Content-Type: application/soap+xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:450df77d-596b-47a5-8124-1f71c58003a8</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://pmp.hug.ch/pmp/services/xds/iti43</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns2:RetrieveDocumentSetRequest xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:ihe:iti:xds-b:2007"><ns2:DocumentRequest><ns2:RepositoryUniqueId>2.999.756.42.1</ns2:RepositoryUniqueId><ns2:DocumentUniqueId>urn:uuid:46e6e9a0-9fcf-3233-b8f6-d67003430c3c</ns2:DocumentUniqueId></ns2:DocumentRequest></ns2:RetrieveDocumentSetRequest></soap:Body></soap:Envelope>

### XDS-43 Document Retrieve APPC FROM CARATEST0001 does not work
POST https://pmp.hug.ch/pmp/services/xds/iti43 HTTP/1.1
Content-Type: application/soap+xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:450df77d-596b-47a5-8124-1f71c58003a8</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://pmp.hug.ch/pmp/services/xds/iti43</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns2:RetrieveDocumentSetRequest xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:ihe:iti:xds-b:2007"><ns2:DocumentRequest><ns2:RepositoryUniqueId>2.999.756.42.1</ns2:RepositoryUniqueId><ns2:DocumentUniqueId>urn:uuid:4492c812-5388-45af-a4ad-71ee994f32bd</ns2:DocumentUniqueId></ns2:DocumentRequest></ns2:RetrieveDocumentSetRequest></soap:Body></soap:Envelope>

